app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("titre", "contenu", "auteur", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["titre", "aaaa"], ["contenu", "aaa"], ["auteur", "aaa"], ["created_at", "2023-05-14 18:46:29.681798"], ["updated_at", "2023-05-14 18:46:29.681798"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "titre" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["titre", "Meilleur Job 2023 après les AI"], ["updated_at", "2023-05-14 19:33:54.719571"], ["id", 4]]